**Data Cleaning**:

This program goes reads in a CSV file, and perfoms a number of data quality checks. Data values that fail the checks are then cleansed.

Initialize imports

In [1]:
import pandas as pd
from pathlib import Path

Read in CSV and take a sample

Set the file path.

In [2]:
file_path = "./order_data.csv"

Take a sample of data.

In [3]:
csv_path = Path(file_path)
data_df = pd.read_csv(csv_path, index_col="order_no")
data_df.sample(5)

           customer_no order_total  order_date
order_no
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
413853121     CM458565         NaN   4/24/2019
4465241327     AK45765    $1103.36  04-25-2019
452519232          NaN     $141.25  01-10-2019

Identify DataFrame Data Types

Retrieve DataFrame data types.

In [4]:
data_df.dtypes

customer_no    object
order_total    object
order_date     object
dtype: object

Assess data quality by identifying the number of rows

Identify Series count.

In [5]:
data_df.count()

customer_no    7
order_total    7
order_date     8
dtype: int64

Assess data quality by identifying the number of times a value occurs

Identify frequency values.

In [6]:
data_df["order_total"].value_counts()

$141.25      2
$1103.36     2
65.42        1
258936.12    1
14.00        1
Name: order_total, dtype: int64

In [7]:
data_df["customer_no"].value_counts()

CM458565    2
AK45765     2
2124        1
TV4663      1
CJ458565    1
Name: customer_no, dtype: int64

Assess data quality by checking for nulls

Check for null values.

In [8]:
data_df.isnull()

            customer_no  order_total  order_date
order_no
452517125         False        False       False
45251825          False        False       False
4465241327        False        False       False
4465241327        False        False       False
413853121         False         True       False
45235825          False        False       False
2356363           False        False       False
452519232          True        False       False

Assess data quality by determining the percentage of nulls

Determine percentage of nulls.

In [9]:
data_df.isnull().mean() * 100

customer_no    12.5
order_total    12.5
order_date      0.0
dtype: float64

Determine number of nulls

In [10]:
data_df.isnull().sum()

customer_no    1
order_total    1
order_date     0
dtype: int64

Cleanse data by filling nulls with default value (i.e. "Unknown", 0, or mean() is common)

Cleanse nulls from DataFrame by filling na.

In [11]:
data_df["customer_no"] = data_df["customer_no"].fillna("Unknown")
data_df

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
413853121     CM458565         NaN   4/24/2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232      Unknown     $141.25  01-10-2019

Cleanse data by dropping nulls

Cleaning nulls from DataFrame by dropping.

In [12]:
data_droppedna_df = data_df.dropna().copy()
data_droppedna_df

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232      Unknown     $141.25  01-10-2019

Check the number of nulls again.

In [13]:
data_df.isnull().sum()

customer_no    0
order_total    1
order_date     0
dtype: int64

Assess data quality by checking for duplicate rows

Check duplicate rows.

In [14]:
data_df.duplicated()

order_no
452517125     False
45251825      False
4465241327    False
4465241327     True
413853121     False
45235825      False
2356363       False
452519232     False
dtype: bool

Assess data quality by checking for duplicate customer_no values

Check duplicates for specific field.

In [15]:
data_df["customer_no"].duplicated()

order_no
452517125     False
45251825      False
4465241327    False
4465241327     True
413853121      True
45235825      False
2356363       False
452519232     False
Name: customer_no, dtype: bool

Cleanse data by dropping duplicates

In [16]:
data_df = data_df.drop_duplicates().copy()
data_df["customer_no"].duplicated()

order_no
452517125     False
45251825      False
4465241327    False
413853121      True
45235825      False
2356363       False
452519232     False
Name: customer_no, dtype: bool

Assess data quality by using head function to sample data and identify currency symbols

Identify if numeric field with $ symbol

In [17]:
data_df.head()

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
413853121     CM458565         NaN   4/24/2019
45235825        TV4663       65.42  04-29-2019

Cleanse data by replacing currency symbols

Clean identified numeric fields with $ symbol.

In [18]:
data_df["order_total"] = data_df["order_total"].str.replace("$", "")
data_df["order_total"]

order_no
452517125        141.25
45251825          14.00
4465241327      1103.36
413853121           NaN
45235825          65.42
2356363       258936.12
452519232        141.25
Name: order_total, dtype: object

Cleanse null from DataFrame by filling na

In [19]:
data_df["order_total"] = data_df["order_total"].fillna(0)
data_df["order_total"]

order_no
452517125        141.25
45251825          14.00
4465241327      1103.36
413853121             0
45235825          65.42
2356363       258936.12
452519232        141.25
Name: order_total, dtype: object

Retrieve data types to confirm what needs to be converted.

In [20]:
data_df.dtypes

customer_no    object
order_total    object
order_date     object
dtype: object

Convert `order_total` from `object` to `float`.

In [21]:
data_df["order_total"] = data_df["order_total"].astype("float")

Confirm conversion worked as expected

In [22]:
data_df.dtypes

customer_no     object
order_total    float64
order_date      object
dtype: object

In [23]:
data_df

           customer_no  order_total  order_date
order_no
452517125     CM458565       141.25  01-10-2019
45251825      CJ458565        14.00  04/25/2019
4465241327     AK45765      1103.36  04-25-2019
413853121     CM458565         0.00   4/24/2019
45235825        TV4663        65.42  04-29-2019
2356363           2124    258936.12  04-29-2019
452519232      Unknown       141.25  01-10-2019